zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F84xxx/MC56F84766/codewarrior/MC56F84766_Vectors.c
/* User could redefine ivINT_I2C0.
Please be noted that ivINT_I2C0 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_I2C0 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_I2C0(void);
__attribute__((weak)) void ivINT_I2C0(void)
{
    I2C0_DriverIRQHandler();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for eFlexPWMB_FAULT **********************/

/* User could redefine ivINT_eFlexPWMB_FAULT.
Please be noted that ivINT_eFlexPWMB_FAULT can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_eFlexPWMB_FAULT definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_eFlexPWMB_FAULT(void);
__attribute__((weak)) void ivINT_eFlexPWMB_FAULT(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for eFlexPWMB_RERR **********************/

/* User could redefine ivINT_eFlexPWMB_RERR.
Please be noted that ivINT_eFlexPWMB_RERR can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_eFlexPWMB_RERR definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_eFlexPWMB_RERR(void);
__attribute__((weak)) void ivINT_eFlexPWMB_RERR(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for eFlexPWMB_RELOAD3 **********************/

/* User could redefine ivINT_eFlexPWMB_RELOAD3.
Please be noted that ivINT_eFlexPWMB_RELOAD3 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_eFlexPWMB_RELOAD3 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_eFlexPWMB_RELOAD3(void);
__attribute__((weak)) void ivINT_eFlexPWMB_RELOAD3(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for eFlexPWMB_CAP3 **********************/

/* User could redefine ivINT_eFlexPWMB_CAP3.
Please be noted that ivINT_eFlexPWMB_CAP3 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_eFlexPWMB_CAP3 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_eFlexPWMB_CAP3(void);
__attribute__((weak)) void ivINT_eFlexPWMB_CAP3(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for eFlexPWMB_CMP3 **********************/

/* User could redefine ivINT_eFlexPWMB_CMP3.
Please be noted that ivINT_eFlexPWMB_CMP3 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_eFlexPWMB_CMP3 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_eFlexPWMB_CMP3(void);
__attribute__((weak)) void ivINT_eFlexPWMB_CMP3(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for eFlexPWMB_RELOAD2 **********************/

/* User could redefine ivINT_eFlexPWMB_RELOAD2.
Please be noted that ivINT_eFlexPWMB_RELOAD2 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_eFlexPWMB_RELOAD2 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_eFlexPWMB_RELOAD2(void);
__attribute__((weak)) void ivINT_eFlexPWMB_RELOAD2(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for eFlexPWMB_CAP2 **********************/

/* User could redefine ivINT_eFlexPWMB_CAP2.
Please be noted that ivINT_eFlexPWMB_CAP2 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_eFlexPWMB_CAP2 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_eFlexPWMB_CAP2(void);
__attribute__((weak)) void ivINT_eFlexPWMB_CAP2(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for eFlexPWMB_CMP2 **********************/

/* User could redefine ivINT_eFlexPWMB_CMP2.
Please be noted that ivINT_eFlexPWMB_CMP2 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_eFlexPWMB_CMP2 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_eFlexPWMB_CMP2(void);
__attribute__((weak)) void ivINT_eFlexPWMB_CMP2(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for eFlexPWMB_RELOAD1 **********************/

/* User could redefine ivINT_eFlexPWMB_RELOAD1.
Please be noted that ivINT_eFlexPWMB_RELOAD1 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_eFlexPWMB_RELOAD1 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_eFlexPWMB_RELOAD1(void);
__attribute__((weak)) void ivINT_eFlexPWMB_RELOAD1(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

/******************* Default ISR for eFlexPWMB_CAP1 **********************/

/* User could redefine ivINT_eFlexPWMB_CAP1.
Please be noted that ivINT_eFlexPWMB_CAP1 can't be defined as normal function,
it should be protected by #pragma interrupt xxx, refer to below ivINT_eFlexPWMB_CAP1 definition. */
#pragma interrupt alignsp saveall
__attribute__((weak)) void ivINT_eFlexPWMB_CAP1(void);
__attribute__((weak)) void ivINT_eFlexPWMB_CAP1(void)
{
    default_interrupt();
}
#pragma interrupt off
/********************************************************************/

